In [1]:
#employee_data = ['Ali', 125000, 'Google', 5]
employee_data = ["Ali Working in Google and his salry is 125000"]

In [2]:
employee_data

['Ali Working in Google and his salry is 125000']

In [3]:
studentData = ["Ali Raza", 22, 91.24, "Computer Science", 5, "University of Agriculture"]

In [4]:
studentData

['Ali Raza', 22, 91.24, 'Computer Science', 5, 'University of Agriculture']

In [13]:
studentData.append(1250)

In [14]:
studentData

['Ali Raza',
 22,
 91.24,
 'Computer Science',
 5,
 'University of Agriculture',
 3037401223,
 3037401223,
 1250]

In [15]:
del studentData[6]

In [16]:
studentData

['Ali Raza',
 22,
 91.24,
 'Computer Science',
 5,
 'University of Agriculture',
 3037401223,
 1250]

In [17]:
del studentData[6]

In [18]:
studentData

['Ali Raza',
 22,
 91.24,
 'Computer Science',
 5,
 'University of Agriculture',
 1250]

In [19]:
#Change Name from 'Ali Raza' to 'Zohaib Ali'
#Change No of subjects from 5 to 7
studentData

['Ali Raza',
 22,
 91.24,
 'Computer Science',
 5,
 'University of Agriculture',
 1250]

In [25]:
studentData.remove("Ali Raza")

In [26]:
studentData.insert(0, "Zohaib")

In [27]:
studentData

['Zohaib', 22, 91.24, 'Computer Science', 5, 'University of Agriculture', 1250]

In [34]:
#pop
salry = studentData.pop(-1)

In [35]:
salry

1250

In [36]:
studentData

['Zohaib', 22, 91.24, 'Computer Science', 5, 'University of Agriculture']

In [37]:
employeeData = [["Ali", 35000, "Software Engineer"],
                    ["Talha", 55000, "Product Manager"],
                     ["Nasir", 79000, "Computer Engineer"],
                        ["Khalid", 44000, "DBA"]]

In [38]:
employeeData

[['Ali', 35000, 'Software Engineer'],
 ['Talha', 55000, 'Product Manager'],
 ['Nasir', 79000, 'Computer Engineer'],
 ['Khalid', 44000, 'DBA']]

In [42]:
for i in employeeData:
    print(i[0])

Ali
Talha
Nasir
Khalid

In [44]:
for i in employeeData:
    print(i[1])

35000
55000
79000
44000

In [45]:
total_salry = 0
for i in employeeData:
    total_salry +=i[1]

In [46]:
total_salry

213000

In [47]:
employeeData

[['Ali', 35000, 'Software Engineer'],
 ['Talha', 55000, 'Product Manager'],
 ['Nasir', 79000, 'Computer Engineer'],
 ['Khalid', 44000, 'DBA']]

In [50]:
for gh in employeeData:
    print(gh[1])

35000
55000
79000
44000

In [59]:
total_Salry_Of_All_Employment = 0

for gh in employeeData:
    total_Salry_Of_All_Employment += gh[1]

In [60]:
total_Salry_Of_All_Employment

213000

In [74]:
employee = ["saad" , 27 , "Male"]
employee1 = ["saad" , 27 , "Male"]

In [78]:
employees = [ employee ,employee1 ["Nasir" , 22 , "Male"],["Ramish" , 18 , "Female"]]= [employee, employee1 , ["Nasir" , 22 , "Male"],["Ramish" , 18 , "Female"]]

SyntaxError: can't assign to literal (<ipython-input-78-c28f98dd9647>, line 1)

In [91]:
employee = ["Zeeshan" , 12500 , "Male"]
employee1 = ["yasin" , 13500 , "Male"]

In [92]:
employees = [employee, employee1 , ["Nasir" , 14500 , "Male"],["Ramish" , 15500, "Female"]]

In [93]:
employees

[['Zeeshan', 12500, 'Male'],
 ['yasin', 13500, 'Male'],
 ['Nasir', 14500, 'Male'],
 ['Ramish', 15500, 'Female']]

In [94]:
total_Salry = 0
for sal in employees:
    total_Salry +=sal[1]

In [95]:
total_Salry

56000

In [96]:
for nam in employees:
    print(nam[0])

Zeeshan
yasin
Nasir
Ramish

In [97]:
for gen in employees:
    print(gen[2])

Male
Male
Male
Female